; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
(define (problem transport-44)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c1)
    (capacity v3 c2)
    (capacity v4 c1)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l4)
    (at p2 l8)
    (at p3 l6)
    (at p4 l10)
    (at p5 l4)
    (at p6 l7)
    (at p7 l9)
    (at p8 l9)
    (at v1 l4)
    (at v2 l10)
    (at v3 l10)
    (at v4 l10)
    (road l9 l10)
    (road l3 l4)
    (road l4 l3)
    (road l3 l1)
    (road l3 l7)
    (road l5 l3)
    (road l6 l8)
    (road l3 l10)
    (road l9 l2)
    (road l7 l3)
    (road l2 l9)
    (road l3 l6)
    (road l8 l6)
    (road l10 l3)
    (road l10 l9)
    (road l6 l3)
    (road l1 l3)
    (road l3 l5)
    (road l1 l9)
    (road l9 l1)
    (road l7 l10)
    (road l10 l7)
    (road l6 l9)
    (road l9 l6)
    (road l2 l7)
    (road l7 l2)
    (road l5 l6)
    (road l6 l5)
    (road l8 l10)
    (road l10 l8)
    (road l3 l9)
    (road l9 l3)
    (road l1 l10)
    (road l10 l1)
    (road l4 l5)
    (road l5 l4)
    (road l1 l7)
    (road l7 l1)
    )
 (:goal (and 
(at p1 l6)
(at p2 l4)
))
)

; plan
1. (drive v4 l10 l8)
   deleted: (at v4 l10)
   added: (at v4 l8)
   goals met: 0 of 2
2. (pick-up v4 l8 p2 c0 c1)
   deleted: (at p2 l8) (capacity v4 c1)
   added: (in p2 v4) (capacity v4 c0)
   goals met: 0 of 2
3. (drive v4 l8 l10)
   deleted: (at v4 l8)
   added: (at v4 l10)
   goals met: 0 of 2
4. (drive v4 l10 l3)
   deleted: (at v4 l10)
   added: (at v4 l3)
   goals met: 0 of 2
5. (drive v4 l3 l4)
   deleted: (at v4 l3)
   added: (at v4 l4)
   goals met: 0 of 2
6. (drop v4 l4 p2 c0 c1)
   deleted: (in p2 v4) (capacity v4 c0)
   added: (at p2 l4) (capacity v4 c1)
   goals met: 1 of 2
7. (pick-up v1 l4 p1 c0 c1)
   deleted: (at p1 l4) (capacity v1 c1)
   added: (in p1 v1) (capacity v1 c0)
   goals met: 1 of 2
8. (drive v1 l4 l3)
   deleted: (at v1 l4)
   added: (at v1 l3)
   goals met: 1 of 2
9. (drive v1 l3 l6)
   deleted: (at v1 l3)
   added: (at v1 l6)
   goals met: 1 of 2
10. (drop v1 l6 p1 c0 c1)
   deleted: (in p1 v1) (capacity v1 c0)
   added: (at p1 l6) (capacity v1 c1)
   goals met: 2 of 2
